
## Plan Result (terraform)

[CI link](https://github.com/naari3/bakatare-minna/actions/runs/7354697720)


<pre><code>Plan: 3 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * google_project_service.enable_api[&#34;secretmanager.googleapis.com&#34;]
  * google_secret_manager_secret.bakatare_discord_bot_token
  * google_secret_manager_secret_iam_member.bakatare_discord_bot_token_accessor


<details><summary>Change Result (Click me)</summary>

```hcl

  # google_project_service.enable_api["secretmanager.googleapis.com"] will be created
  + resource "google_project_service" "enable_api" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = "bakatare-minecraft"
      + service                    = "secretmanager.googleapis.com"
    }

  # google_secret_manager_secret.bakatare_discord_bot_token will be created
  + resource "google_secret_manager_secret" "bakatare_discord_bot_token" {
      + create_time           = (known after apply)
      + effective_annotations = (known after apply)
      + effective_labels      = (known after apply)
      + expire_time           = (known after apply)
      + id                    = (known after apply)
      + name                  = (known after apply)
      + project               = "bakatare-minecraft"
      + secret_id             = "bakatare-discord-bot-token"
      + terraform_labels      = (known after apply)

      + replication {
          + auto {
            }
        }
    }

  # google_secret_manager_secret_iam_member.bakatare_discord_bot_token_accessor will be created
  + resource "google_secret_manager_secret_iam_member" "bakatare_discord_bot_token_accessor" {
      + etag      = (known after apply)
      + id        = (known after apply)
      + member    = "serviceAccount:bakatare@bakatare-minecraft.iam.gserviceaccount.com"
      + project   = (known after apply)
      + role      = "roles/secretmanager.secretAccessor"
      + secret_id = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"plan","PRNumber":31,"Program":"tfcmt","SHA1":"42dbefcc3fa42deb9b66b4d4b19c577ba8a4a70c","Target":"terraform","Vars":{},"WorkflowName":"test"} -->